Revit 2027 API
MechanicalSystemType.RiseDropSettings Property
 indicates the rise/drop symbol given the system type
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RiseDropSymbol RiseDropSettings { get; set; }
Public Property RiseDropSettings As RiseDropSymbol
	Get
	Set
public:
property RiseDropSymbol RiseDropSettings {
	RiseDropSymbol get ();
	void set (RiseDropSymbol value);
}
member RiseDropSettings : RiseDropSymbol with get, set
Property Value
RiseDropSymbol
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input is not a valid HVAC rise/drop symbol type.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
MechanicalSystemType Class
Autodesk.Revit.DB.Mechanical Namespace